if [ -z "$1" ]; then
  echo "Ошибка: Необходимо указать директорию для добавления в PATH."
  exit 1
fi


if [ ! -d "$1" ]; then
  echo "Ошибка: Директория '$1' не существует."
  exit 1
fi

current_path="$PATH"

new_path="$current_path:$1"

echo "Текущий PATH: $current_path"
echo "Новый PATH: $new_path"

export PATH="$new_path"

echo "PATH после изменения: $PATH"

#Изменения переменной PATH, сделанные через терминал (например, с помощью export PATH="$new_path"),
#являются временными, потому что они действуют только в рамках текущей сессии терминала.
#Когда терминал закроется, все переменные окружения, включая PATH, теряют свои значения.

#Чтобы изменения в PATH стали постоянными, необходимо добавить команду export PATH="$new_path" 
#в один из файлов инициализации оболочки, например в .bashrc.  Эти файлы выполняются при запуске нового терминала, 
#поэтому изменения PATH будут применяться автоматически.
# Добавить команду можно следующим образом echo -e "export PATH=\"$new_path\"" >> ~/.bashrc